Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0085] The terminal is a device having a wireless transceiver function, may be deployed on land, and includes an indoor device, an outdoor device, a handheld device, or a vehicle-mounted device.
de_de: [0085] Das Endgerät ist eine Vorrichtung mit einer drahtlosen Sendeempfängerfunktion, kann an Land eingesetzt werden und beinhaltet eine Innenvorrichtung, eine Außenvorrichtung, eine handgehaltene Vorrichtung oder eine fahrzeugmontierte Vorrichtung.

source: The terminal may alternatively be deployed on a water surface (for example, on a ship).
de_de: Das Endgerät kann alternativ auf einer Wasseroberfläche (zum Beispiel auf einem Schiff) eingesetzt werden.

source: The terminal may alternatively be deployed in the air (for example, on an aircraft, a balloon, and a satellite).
de_de: Das Endgerät kann alternativ in der Luft (zum Beispiel auf einem Flugzeug, einem Ballon und einem Satelliten) eingesetzt werden.

source: The terminal may be a mobile phone (mobile phone), a tablet (pad), a computer having a wireless transceiver function, a virtual reality (virtual reality, VR) terminal, an augmented reality (augmented reality, AR) terminal, a wireless terminal in industrial control (industrial control), a wireless terminal in unmanned driving (self driving), a wireless terminal in remote medical (remote medical), a wireless terminal in smart grid (smart grid), a wireless terminal in transportation safety (transportation safety), a wireless terminal in smart city (smart city), a wireless terminal in smart home (smart home), or the like.
de_de: Das Endgerät kann ein Mobiltelefon (Mobiltelefon), ein Tablet (Pad), ein Computer mit einer drahtlosen Transceiver-Funktion, ein Virtual-Reality- (Virtual-Reality-, VR-) Endgerät, ein Augmented-Reality- (Augmented-Reality-, AR-) Endgerät, ein drahtloses Endgerät in der industriellen Steuerung (industrielle Steuerung), ein drahtloses Endgerät im unbemannten Fahren (Selbstfahren), ein drahtloses Endgerät in der Fernmedizin (Fernmedizin), ein drahtloses Endgerät im intelligenten Netz (intelligentes Netz), ein drahtloses Endgerät in der Verkehrssicherheit (Verkehrssicherheit), ein drahtloses Endgerät in der intelligenten Stadt (intelligente Stadt), ein drahtloses Endgerät im intelligenten Heim (intelligentes Heim) oder dergleichen sein.

source: [0086] A base station is a device that provides a wireless communication function for a terminal, and includes but is not limited to a next generation base station (g nodeB, gNB) in 5G, an evolved NodeB (evolved node B, eNB), a radio network controller (radio network controller, RNC), a NodeB (node B, NB), a base station controller (base station controller, BSC), a base transceiver station (base transceiver station, BTS), a home base station (for example, a home evolved nodeB or a home node B, HNB), a baseband unit (BaseBand Unit, BBU), a transmission point (transmitting and receiving point, TRP), a transmitting point (transmitting point, TP), a mobile switching center, and the like.
de_de: [0086] Eine Basisstation ist eine Vorrichtung, die eine drahtlose Kommunikationsfunktion für ein Endgerät bereitstellt und eine Basisstation der nächsten Generation (gNodeB, gNB) in 5G, einen weiterentwickelten NodeB (weiterentwickelter NodeB, eNB), eine Funknetzsteuerung (Funknetzsteuerung, RNC), einen NodeB (NodeB, NB), eine Basisstationssteuerung (Basisstationssteuerung, BSC), eine Basis-Transceiver-Station (Basis-Transceiver-Station, BTS), eine Heim-Basisstation (zum Beispiel einen Heim-weiterentwickelten NodeB oder einen Heim-NodeB, HNB), eine Basisbandeinheit (BaseBand Unit, BBU), einen Übertragungspunkt (Übertragungs- und Empfangspunkt, TRP), einen Übertragungspunkt (Übertragungspunkt, TP), eine Mobilvermittlungsstelle und dergleichen umfasst, aber nicht darauf beschränkt ist.

source: [0087] In this application, a terminal generally has three states, namely, a connected (connected) state, an idle (idle) state, and an inactive (inactive) state.
de_de: [0087] In dieser Anmeldung weist ein Endgerät im Allgemeinen drei Zustände auf, nämlich einen verbundenen (connected) Zustand, einen Ruhezustand (idle state) und einen inaktiven (inactive) Zustand.

source: [0088] When the terminal is in the connected state, the terminal is in a normal working state.
de_de: [0088] Wenn sich das Endgerät im verbundenen Zustand befindet, befindet sich das Endgerät in einem normalen Arbeitszustand.

source: User data may be sent and received between a network side and the terminal.
de_de: Benutzerdaten können zwischen einer Netzwerkseite und dem Endgerät gesendet und empfangen werden.

source: [0089] When the terminal enters the idle state from the connected state, the terminal and the base station generally delete all access stratum (access stratum, AS) contexts of the terminal. In a special case, in 4G, when the network side releases a connection of the terminal due to a suspend reason, the terminal also enters the idle state from the connected state.
de_de: [0089] Wenn das Endgerät aus dem verbundenen Zustand in den Ruhezustand eintritt, löschen das Endgerät und die Basisstation im Allgemeinen alle Access-Stratum-(Access-Stratum, AS)-Kontexte des Endgeräts. In einem besonderen Fall, in 4G, wenn die Netzwerkseite eine Verbindung des Endgeräts aufgrund eines Aussetzungsgrunds freigibt, tritt das Endgerät auch aus dem verbundenen Zustand in den Ruhezustand ein.

source: However, in this case, the terminal and the base station delete a part of AS contexts, and retain a part of the AS contexts, for example, may retain an access stratum key (which may be referred to as a KeNB in 4G), a security capability of the terminal, and a security algorithm (including an integrity protection algorithm and an encryption algorithm) for communication between the terminal and a source base station accessed by the terminal. The security capability of the terminal refers to a security algorithm supported by the terminal, including a supported encryption algorithm and a supported integrity protection algorithm.
de_de: In diesem Fall löschen das Endgerät und die Basisstation jedoch einen Teil von AS-Kontexten und behalten einen Teil der AS-Kontexte, z. B. können sie einen Zugriffsschichtschlüssel (der in 4G als KeNB bezeichnet werden kann), eine Sicherheitsfähigkeit des Endgeräts und einen Sicherheitsalgorithmus (einschließlich eines Integritätsschutzalgorithmus und eines Verschlüsselungsalgorithmus) für die Kommunikation zwischen dem Endgerät und einer Quellbasisstation, auf die das Endgerät zugreift, behalten. Die Sicherheitsfähigkeit des Endgeräts bezieht sich auf einen Sicherheitsalgorithmus, der von dem Endgerät unterstützt wird, einschließlich eines unterstützten Verschlüsselungsalgorithmus und eines unterstützten Integritätsschutzalgorithmus.

source: In this case, a special idle state in which the terminal is located may be referred to as a suspend state.
de_de: In diesem Fall kann ein spezieller Ruhezustand, in dem sich das Endgerät befindet, als Aussetzungszustand bezeichnet werden.

source: [0090] In 5G, an inactive state is introduced.
de_de: [0090] Bei 5G wird ein inaktiver Zustand eingeführt.

source: When the terminal enters the inactive state from the connected state, the base station suspends the terminal. In this case, the terminal and the base station delete a part of AS contexts, and retain a part of the AS contexts, for example, may retain an access stratum key (which may be referred to as KgNB in 5G), a security capability of the terminal, and a security algorithm (including an integrity protection algorithm and an encryption algorithm) for communication between the terminal and a source base station accessed by the terminal. The security capability of the terminal refers to a security algorithm supported by the terminal, including a supported encryption algorithm and a supported integrity protection algorithm.
de_de: Wenn das Endgerät aus dem verbundenen Zustand in den inaktiven Zustand eintritt, setzt die Basisstation das Endgerät aus. In diesem Fall löschen das Endgerät und die Basisstation einen Teil von AS-Kontexten und behalten einen Teil der AS-Kontexte, beispielsweise können sie einen Zugriffsschichtschlüssel (der in 5G als KgNB bezeichnet werden kann), eine Sicherheitsfähigkeit des Endgeräts und einen Sicherheitsalgorithmus (einschließlich eines Integritätsschutzalgorithmus und eines Verschlüsselungsalgorithmus) für die Kommunikation zwischen dem Endgerät und einer Quellbasisstation, auf die das Endgerät zugreift, behalten. Die Sicherheitsfähigkeit des Endgeräts bezieht sich auf einen Sicherheitsalgorithmus, der von dem Endgerät unterstützt wird, einschließlich eines unterstützten Verschlüsselungsalgorithmus und eines unterstützten Integritätsschutzalgorithmus.

source: [0091] For ease of description, the suspend state defined in 4G and the inactive state defined in 5G are collectively referred to as an inactive state subsequently.
de_de: [0091] Der Einfachheit der Beschreibung halber werden der in 4G definierte Aussetzungszustand und der in 5G definierte inaktive Zustand im Folgenden gemeinsam als inaktiver Zustand bezeichnet.

source: When the terminal is in the inactive state, both the terminal and the base station accessed by the terminal before the terminal enters the inactive state store a part of AS contexts.
de_de: Wenn sich das Endgerät im inaktiven Zustand befindet, speichern sowohl das Endgerät als auch die Basisstation, auf die das Endgerät zugreift, bevor das Endgerät in den inaktiven Zustand eintritt, einen Teil von AS-Kontexten.

source: For specific content, refer to the foregoing description.
de_de: Für spezifischen Inhalt sei auf die vorstehende Beschreibung hingewiesen.

source: [0092] When the terminal is in the inactive state, because a part of AS contexts are retained on the terminal, the terminal enters the connected state from the inactive state more quickly than the terminal enters the connected state from the idle state.
de_de: [0092] Wenn sich das Endgerät im inaktiven Zustand befindet, da ein Teil der AS-Kontexte auf dem Endgerät beibehalten wird, tritt das Endgerät schneller aus dem inaktiven Zustand in den verbundenen Zustand ein, als das Endgerät aus dem Ruhezustand in den verbundenen Zustand eintritt.

source: [0093] In addition, considering mobility of the terminal, when the terminal is resumed from the inactive state to the connected state, the terminal may need to change a base station.
de_de: [0093] Darüber hinaus muss das Endgerät unter Berücksichtigung der Mobilität des Endgeräts möglicherweise eine Basisstation wechseln, wenn das Endgerät wieder aus dem inaktiven Zustand in den verbundenen Zustand übergeht.

source: To be specific, the terminal first establishes a connection to the source base station, and then enters the inactive state in the source base station due to some reasons, for example, a network side notification.
de_de: Konkret stellt das Endgerät zuerst eine Verbindung mit der Quellbasisstation her und tritt dann aufgrund einiger Gründe, zum Beispiel einer netzseitigen Benachrichtigung, in den inaktiven Zustand in der Quellbasisstation ein.

source: When the terminal expects to resume to the connected state, if the terminal has moved to coverage of the target base station, the terminal is resumed from the inactive state to the connected state in the target base station.
de_de: Wenn das Endgerät erwartet, in den verbundenen Zustand zurückzukehren, wird, wenn sich das Endgerät in die Abdeckung der Zielbasisstation bewegt hat, das Endgerät von dem inaktiven Zustand in den verbundenen Zustand in der Zielbasisstation zurückgeführt.

source: [0094] Certainly, this application is also applicable to a scenario in which a target base station accessed by the terminal is the same as a source base station when the terminal is resumed from the inactive state to the connected state.
de_de: [0094] Sicherlich ist diese Anwendung auch auf ein Szenario anwendbar, in dem eine Zielbasisstation, auf die durch das Endgerät zugegriffen wird, dieselbe wie eine Quellbasisstation ist, wenn das Endgerät von dem inaktiven Zustand in den verbundenen Zustand zurückgeführt wird.

source: In other words, the base station accessed by the terminal may alternatively not change, and is still the same base station.
de_de: Mit anderen Worten, die Basisstation, auf die durch das Endgerät zugegriffen wird, kann sich alternativ nicht ändern und ist immer noch dieselbe Basisstation.

source: [0095] The following describes a process in which the terminal enters the inactive state from the connected state.
de_de: [0095] Im Folgenden ist ein Prozess beschrieben, bei dem das Endgerät aus dem verbundenen Zustand in den inaktiven Zustand eintritt.

source: [0096] FIG. 2 is a schematic diagram of a process of entering an inactive state from a connected state by a terminal according to this application, including the following steps.
de_de: [0096] FIG. 2 ist ein schematisches Diagramm eines Prozesses des Eintretens in einen inaktiven Zustand aus einem verbundenen Zustand durch ein Endgerät gemäß dieser Anmeldung, einschließlich der folgenden Schritte.

source: [0097] Step 201: A base station determines to suspend a radio resource control (radio resource control, RRC) connection of a terminal.
de_de: [0097] Schritt 201: Eine Basisstation bestimmt, eine Funkressourcensteuerungs-(RRC-)Verbindung eines Endgeräts auszusetzen.

source: [0098] For example, when the base station does not receive, within a period of time, data sent by the terminal, the base station determines to suspend the terminal.
de_de: [0098] Wenn die Basisstation zum Beispiel innerhalb eines Zeitraums keine Daten empfängt, die durch das Endgerät gesendet werden, bestimmt die Basisstation, das Endgerät auszusetzen.

source: [0099] Step 202: The base station sends a suspend message to the terminal.
de_de: [0099] Schritt 202: Die Basisstation sendet eine Aussetzungsnachricht an das Endgerät.

source: [0100] The suspend message is used to instruct the terminal to release the RRC connection and enter the inactive state.
de_de: [0100] Die Aussetzungsnachricht wird verwendet, um das Endgerät anzuweisen, die RRC-Verbindung freizugeben und in den inaktiven Zustand einzutreten.

source: The suspend message may be, for example, an RRC connection release message having a special indication.
de_de: Die Aussetzungsnachricht kann zum Beispiel eine RRC-Verbindungsfreigabenachricht mit einer speziellen Angabe sein.

source: [0101] During specific implementation, the suspend message may carry the following parameter: a resume identifier.
de_de: [0101] Während einer spezifischen Implementierung kann die Aussetzungsnachricht den folgenden Parameter führen: eine Wiederaufnahmekennung.

source: Optionally, the suspend message may further carry a next hop chaining counter (next hop chaining counter, NCC) and the like.
de_de: Optional kann die Aussetzungsnachricht ferner einen Nächster-Sprung-Verkettungszähler (Next-Hop-Verkettungszähler, NCC) und dergleichen führen.

source: [0102] The resume identifier is a required parameter when the terminal subsequently enters the connected state from the inactive state.
de_de: [0102] Die Wiederaufnahmekennung ist ein erforderlicher Parameter, wenn das Endgerät anschließend aus dem inaktiven Zustand in den verbundenen Zustand eintritt.

source: The resume identifier may include information such as an identifier of the source base station and an identifier of the terminal. Specifically, the resume identifier may be a resume ID, or an inactive-cell radio network temporary identifier (INACTIVE-cell radio network temporary identifier, I-RNTI).
de_de: Die Wiederaufnahmekennung kann Informationen, wie z. B. eine Kennung der Quellbasisstation und eine Kennung des Endgeräts, enthalten. Insbesondere kann die Wiederaufnahmekennung eine Wiederaufnahme-ID oder eine temporäre Kennung eines inaktiven Zellenfunknetzes (temporäre Kennung eines inaktiven Zellenfunknetzes, INACTIVE-cell radio network temporary identifier, I-RNTI) sein.

source: [0103] The NCC is an optional parameter, and the NCC may also be a required parameter when the terminal subsequently enters the connected state from the inactive state.
de_de: [0103] Der NCC ist ein optionaler Parameter, und der NCC kann auch ein erforderlicher Parameter sein, wenn das Endgerät anschließend aus dem inaktiven Zustand in den verbundenen Zustand eintritt.

source: If the suspend message carries the NCC, an access stratum key subsequently used by the terminal and the base station should be updated.
de_de: Wenn die Unterbrechungsnachricht den NCC trägt, sollte ein Zugriffsschichtschlüssel, der anschließend von dem Endgerät und der Basisstation verwendet wird, aktualisiert werden.

source: The NCC is a parameter required for generating a new access stratum key.
de_de: Der NCC ist ein Parameter, der zum Erzeugen eines neuen Zugriffsschichtschlüssels erforderlich ist.

source: In other words, the NCC may be used to generate a new access stratum key (in this application, KgNB* is used to represent the new access stratum key).
de_de: Mit anderen Worten kann der NCC verwendet werden, um einen neuen Zugriffsschichtschlüssel zu erzeugen (in dieser Anwendung wird KgNB* verwendet, um den neuen Zugriffsschichtschlüssel darzustellen).

source: If the suspend message does not carry the NCC, an access stratum key subsequently used by the terminal and the base station should not be updated, that is, always remains unchanged.
de_de: Wenn die Suspendierungsnachricht den NCC nicht enthält, sollte ein Zugriffsschichtschlüssel, der anschließend vom Endgerät und der Basisstation verwendet wird, nicht aktualisiert werden, d. h. er bleibt immer unverändert.

source: [0104] Optionally, the suspend message may further carry a cause parameter releaseCause, and releaseCause is used to instruct the terminal to perform a suspend operation and enter the inactive state.
de_de: [0104] Optional kann die Unterbrechungsnachricht ferner einen Ursachenparameter releaseCause tragen, und releaseCause wird verwendet, um das Endgerät anzuweisen, eine Unterbrechungsoperation durchzuführen und in den inaktiven Zustand einzutreten.

source: For example, releaseCause may be set to "RRC Suspend" or "RRC Inactive".
de_de: Zum Beispiel kann releaseCause auf „RRC Suspend“ oder „RRC Inactive“ gesetzt werden.

source: When the terminal obtains the releaseCause parameter, and determines that a value of releaseCause is "RRC Suspend" or "RRC Inactive", the terminal performs a related operation of suspending the terminal.
de_de: Wenn das Endgerät den releaseCause-Parameter erhält und bestimmt, dass ein Wert von releaseCause „RRC Suspend“ oder „RRC Inactive“ ist, führt das Endgerät eine zugehörige Operation des Suspendierens des Endgeräts aus.

source: [0105] Optionally, the base station may further instruct a control plane network element in a core network to release a bearer, for example, release a signaling radio bearer (signaling radio bearer, SRB) or a data radio bearer (data radio bearer, DRB).
de_de: [0105] Optional kann die Basisstation ferner ein Steuerebenennetzwerkelement in einem Kernnetzwerk anweisen, einen Träger freizugeben, zum Beispiel einen Signalisierungsfunkträger (signaling radio bearer, SRB) oder einen Datenfunkträger (data radio bearer, DRB) freizugeben.

source: [0106] Step 203: The terminal enters the inactive state.
de_de: [0106] Schritt 203: Das Endgerät tritt in den inaktiven Zustand ein.

source: [0107] The terminal deletes a part of AS contexts, and retains a part of the AS contexts.
de_de: [0107] Das Endgerät löscht einen Teil von AS-Kontexten und behält einen Teil der AS-Kontexte bei.

source: The retained part of AS contexts include an access stratum key, a security capability of the terminal, an integrity protection algorithm and an encryption algorithm for communication between the terminal and the source base station accessed by the terminal, and the like.
de_de: Der beibehaltene Teil von AS-Kontexten beinhaltet einen Zugriffsschichtschlüssel, eine Sicherheitsfähigkeit des Endgeräts, einen Integritätsschutzalgorithmus und einen Verschlüsselungsalgorithmus zur Kommunikation zwischen dem Endgerät und der Quellbasisstation, auf die das Endgerät zugreift, und dergleichen.

source: [0108] The terminal further stores the resume identifier sent by the base station.
de_de: [0108] Das Endgerät speichert ferner die von der Basisstation gesendete Wiederaufnahmekennung.

source: Optionally, the terminal further stores a parameter such as the NCC.
de_de: Optional speichert das Endgerät ferner einen Parameter wie den NCC.

source: [0109] The terminal suspends a bearer, for example, suspends a signaling radio bearer or a data radio bearer, and then enters the inactive state.
de_de: [0109] Das Endgerät unterbricht einen Träger, zum Beispiel unterbricht einen Signalisierungsfunkträger oder einen Datenfunkträger, und tritt dann in den inaktiven Zustand ein.

source: [0110] It can be learned from the foregoing process in which the terminal enters the inactive state from the connected state that after the terminal enters the inactive state, the terminal stores the part of AS contexts and parameters received from the base station.
de_de: [0110] Aus dem vorstehenden Prozess, in dem das Endgerät aus dem verbundenen Zustand in den inaktiven Zustand eintritt, kann gelernt werden, dass das Endgerät, nachdem das Endgerät in den inaktiven Zustand eintritt, den Teil der AS-Kontexte und Parameter speichert, die von der Basisstation empfangen werden.

source: Therefore, when the terminal subsequently expects to resume from the inactive state to the connected state, these parameters help the terminal quickly resume from the inactive state to the connected state.
de_de: Wenn das Endgerät anschließend erwartet, aus dem inaktiven Zustand in den verbundenen Zustand zurückzukehren, helfen diese Parameter dem Endgerät daher, schnell aus dem inaktiven Zustand in den verbundenen Zustand zurückzukehren.

source: [0111] It should be noted that the base station accessed by the terminal may also be referred to as a source base station accessed by the terminal. When the terminal requests to resume a connection, a base station that the terminal requests to access may be a source base station, or may be another base station, and may be referred to as a target base station.
de_de: [0111] Es ist anzumerken, dass die Basisstation, auf die durch das Endgerät zugegriffen wird, auch als eine Quellbasisstation bezeichnet werden kann, auf die durch das Endgerät zugegriffen wird. Wenn das Endgerät anfordert, eine Verbindung wieder aufzunehmen, kann eine Basisstation, auf die durch das Endgerät zugegriffen wird, eine Quellbasisstation sein oder kann eine andere Basisstation sein und kann als eine Zielbasisstation bezeichnet werden.

source: [0112] The following describes several connection resume request methods into which a scenario in which the base station performs rejection is introduced.
de_de: [0112] Im Folgenden werden mehrere Verbindungswiederaufnahmeanforderungsverfahren beschrieben, in die ein Szenario eingeführt wird, in dem die Basisstation eine Zurückweisung durchführt.

source: To be specific, the terminal requests to resume from the inactive state to the connected state, and the terminal requests, in the target base station, to resume from the inactive state to the connected state.
de_de: Insbesondere fordert das Endgerät auf, vom inaktiven Zustand in den verbundenen Zustand wiederaufzunehmen, und das Endgerät fordert in der Zielbasisstation auf, vom inaktiven Zustand in den verbundenen Zustand wiederaufzunehmen.
